{
 "module": "keras",
 "class_name": "Sequential",
 "config": {
  "name": "sequential_1",
  "trainable": true,
  "dtype": {
   "module": "keras",
   "class_name": "DTypePolicy",
   "config": {
    "name": "float32"
   },
   "registered_name": null
  },
  "layers": [
   {
    "module": "keras.layers",
    "class_name": "InputLayer",
    "config": {
     "batch_shape": [
      null,
      24,
      9
     ],
     "dtype": "float32",
     "sparse": false,
     "name": "input_layer_1"
    },
    "registered_name": null
   },
   {
    "module": "keras.layers",
    "class_name": "Bidirectional",
    "config": {
     "name": "bidirectional_1",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "merge_mode": "concat",
     "layer": {
      "module": "keras.layers",
      "class_name": "LSTM",
      "config": {
       "name": "forward_lstm_4",
       "trainable": true,
       "dtype": {
        "module": "keras",
        "class_name": "DTypePolicy",
        "config": {
         "name": "float32"
        },
        "registered_name": null
       },
       "return_sequences": true,
       "return_state": false,
       "go_backwards": false,
       "stateful": false,
       "unroll": false,
       "zero_output_for_mask": true,
       "units": 256,
       "activation": "tanh",
       "recurrent_activation": "sigmoid",
       "use_bias": true,
       "kernel_initializer": {
        "module": "keras.initializers",
        "class_name": "GlorotUniform",
        "config": {
         "seed": null
        },
        "registered_name": null
       },
       "recurrent_initializer": {
        "module": "keras.initializers",
        "class_name": "OrthogonalInitializer",
        "config": {
         "seed": null,
         "gain": 1.0
        },
        "registered_name": null
       },
       "bias_initializer": {
        "module": "keras.initializers",
        "class_name": "Zeros",
        "config": {},
        "registered_name": null
       },
       "unit_forget_bias": true,
       "kernel_regularizer": {
        "module": "keras.regularizers",
        "class_name": "L2",
        "config": {
         "l2": 0.01
        },
        "registered_name": null
       },
       "recurrent_regularizer": null,
       "bias_regularizer": null,
       "activity_regularizer": null,
       "kernel_constraint": null,
       "recurrent_constraint": null,
       "bias_constraint": null,
       "dropout": 0.0,
       "recurrent_dropout": 0.2,
       "seed": null
      },
      "registered_name": null,
      "build_config": {
       "input_shape": [
        null,
        24,
        9
       ]
      }
     },
     "backward_layer": {
      "module": "keras.layers",
      "class_name": "LSTM",
      "config": {
       "name": "backward_lstm_4",
       "trainable": true,
       "dtype": {
        "module": "keras",
        "class_name": "DTypePolicy",
        "config": {
         "name": "float32"
        },
        "registered_name": null
       },
       "return_sequences": true,
       "return_state": false,
       "go_backwards": true,
       "stateful": false,
       "unroll": false,
       "zero_output_for_mask": true,
       "units": 256,
       "activation": "tanh",
       "recurrent_activation": "sigmoid",
       "use_bias": true,
       "kernel_initializer": {
        "module": "keras.initializers",
        "class_name": "GlorotUniform",
        "config": {
         "seed": null
        },
        "registered_name": null
       },
       "recurrent_initializer": {
        "module": "keras.initializers",
        "class_name": "OrthogonalInitializer",
        "config": {
         "seed": null,
         "gain": 1.0
        },
        "registered_name": null
       },
       "bias_initializer": {
        "module": "keras.initializers",
        "class_name": "Zeros",
        "config": {},
        "registered_name": null
       },
       "unit_forget_bias": true,
       "kernel_regularizer": {
        "module": "keras.regularizers",
        "class_name": "L2",
        "config": {
         "l2": 0.01
        },
        "registered_name": null
       },
       "recurrent_regularizer": null,
       "bias_regularizer": null,
       "activity_regularizer": null,
       "kernel_constraint": null,
       "recurrent_constraint": null,
       "bias_constraint": null,
       "dropout": 0.0,
       "recurrent_dropout": 0.2,
       "seed": null
      },
      "registered_name": null,
      "build_config": {
       "input_shape": [
        null,
        24,
        9
       ]
      }
     }
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      24,
      9
     ]
    }
   },
   {
    "module": "keras.layers",
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_4",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "axis": -1,
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "gamma_initializer": {
      "module": "keras.initializers",
      "class_name": "Ones",
      "config": {},
      "registered_name": null
     },
     "moving_mean_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "moving_variance_initializer": {
      "module": "keras.initializers",
      "class_name": "Ones",
      "config": {},
      "registered_name": null
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null,
     "synchronized": false
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      24,
      512
     ]
    }
   },
   {
    "module": "keras.layers",
    "class_name": "Dropout",
    "config": {
     "name": "dropout_3",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "rate": 0.3,
     "seed": null,
     "noise_shape": null
    },
    "registered_name": null
   },
   {
    "module": "keras.layers",
    "class_name": "LSTM",
    "config": {
     "name": "lstm_5",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "return_sequences": true,
     "return_state": false,
     "go_backwards": false,
     "stateful": false,
     "unroll": false,
     "zero_output_for_mask": false,
     "units": 128,
     "activation": "tanh",
     "recurrent_activation": "sigmoid",
     "use_bias": true,
     "kernel_initializer": {
      "module": "keras.initializers",
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      },
      "registered_name": null
     },
     "recurrent_initializer": {
      "module": "keras.initializers",
      "class_name": "OrthogonalInitializer",
      "config": {
       "seed": null,
       "gain": 1.0
      },
      "registered_name": null
     },
     "bias_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "unit_forget_bias": true,
     "kernel_regularizer": {
      "module": "keras.regularizers",
      "class_name": "L2",
      "config": {
       "l2": 0.01
      },
      "registered_name": null
     },
     "recurrent_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "recurrent_constraint": null,
     "bias_constraint": null,
     "dropout": 0.0,
     "recurrent_dropout": 0.2,
     "seed": null
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      24,
      512
     ]
    }
   },
   {
    "module": "keras.layers",
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_5",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "axis": -1,
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "gamma_initializer": {
      "module": "keras.initializers",
      "class_name": "Ones",
      "config": {},
      "registered_name": null
     },
     "moving_mean_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "moving_variance_initializer": {
      "module": "keras.initializers",
      "class_name": "Ones",
      "config": {},
      "registered_name": null
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null,
     "synchronized": false
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      24,
      128
     ]
    }
   },
   {
    "module": "keras.layers",
    "class_name": "Dropout",
    "config": {
     "name": "dropout_4",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "rate": 0.3,
     "seed": null,
     "noise_shape": null
    },
    "registered_name": null
   },
   {
    "module": "keras.layers",
    "class_name": "LSTM",
    "config": {
     "name": "lstm_6",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "return_sequences": true,
     "return_state": false,
     "go_backwards": false,
     "stateful": false,
     "unroll": false,
     "zero_output_for_mask": false,
     "units": 64,
     "activation": "tanh",
     "recurrent_activation": "sigmoid",
     "use_bias": true,
     "kernel_initializer": {
      "module": "keras.initializers",
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      },
      "registered_name": null
     },
     "recurrent_initializer": {
      "module": "keras.initializers",
      "class_name": "OrthogonalInitializer",
      "config": {
       "seed": null,
       "gain": 1.0
      },
      "registered_name": null
     },
     "bias_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "unit_forget_bias": true,
     "kernel_regularizer": {
      "module": "keras.regularizers",
      "class_name": "L2",
      "config": {
       "l2": 0.01
      },
      "registered_name": null
     },
     "recurrent_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "recurrent_constraint": null,
     "bias_constraint": null,
     "dropout": 0.0,
     "recurrent_dropout": 0.2,
     "seed": null
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      24,
      128
     ]
    }
   },
   {
    "module": "keras.layers",
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_6",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "axis": -1,
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "gamma_initializer": {
      "module": "keras.initializers",
      "class_name": "Ones",
      "config": {},
      "registered_name": null
     },
     "moving_mean_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "moving_variance_initializer": {
      "module": "keras.initializers",
      "class_name": "Ones",
      "config": {},
      "registered_name": null
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null,
     "synchronized": false
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      24,
      64
     ]
    }
   },
   {
    "module": "keras.layers",
    "class_name": "Dropout",
    "config": {
     "name": "dropout_5",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "rate": 0.2,
     "seed": null,
     "noise_shape": null
    },
    "registered_name": null
   },
   {
    "module": "keras.layers",
    "class_name": "LSTM",
    "config": {
     "name": "lstm_7",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "return_sequences": false,
     "return_state": false,
     "go_backwards": false,
     "stateful": false,
     "unroll": false,
     "zero_output_for_mask": false,
     "units": 32,
     "activation": "tanh",
     "recurrent_activation": "sigmoid",
     "use_bias": true,
     "kernel_initializer": {
      "module": "keras.initializers",
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      },
      "registered_name": null
     },
     "recurrent_initializer": {
      "module": "keras.initializers",
      "class_name": "OrthogonalInitializer",
      "config": {
       "seed": null,
       "gain": 1.0
      },
      "registered_name": null
     },
     "bias_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "unit_forget_bias": true,
     "kernel_regularizer": {
      "module": "keras.regularizers",
      "class_name": "L2",
      "config": {
       "l2": 0.01
      },
      "registered_name": null
     },
     "recurrent_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "recurrent_constraint": null,
     "bias_constraint": null,
     "dropout": 0.0,
     "recurrent_dropout": 0.2,
     "seed": null
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      24,
      64
     ]
    }
   },
   {
    "module": "keras.layers",
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_7",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "axis": -1,
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "gamma_initializer": {
      "module": "keras.initializers",
      "class_name": "Ones",
      "config": {},
      "registered_name": null
     },
     "moving_mean_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "moving_variance_initializer": {
      "module": "keras.initializers",
      "class_name": "Ones",
      "config": {},
      "registered_name": null
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null,
     "synchronized": false
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      32
     ]
    }
   },
   {
    "module": "keras.layers",
    "class_name": "Dense",
    "config": {
     "name": "dense_1",
     "trainable": true,
     "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
       "name": "float32"
      },
      "registered_name": null
     },
     "units": 24,
     "activation": "linear",
     "use_bias": true,
     "kernel_initializer": {
      "module": "keras.initializers",
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      },
      "registered_name": null
     },
     "bias_initializer": {
      "module": "keras.initializers",
      "class_name": "Zeros",
      "config": {},
      "registered_name": null
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "registered_name": null,
    "build_config": {
     "input_shape": [
      null,
      32
     ]
    }
   }
  ],
  "build_input_shape": [
   null,
   24,
   9
  ]
 },
 "registered_name": null,
 "build_config": {
  "input_shape": [
   null,
   24,
   9
  ]
 },
 "compile_config": {
  "optimizer": {
   "module": "keras.optimizers",
   "class_name": "Adam",
   "config": {
    "name": "adam",
    "learning_rate": 6.25000029685907e-05,
    "weight_decay": null,
    "clipnorm": null,
    "global_clipnorm": null,
    "clipvalue": null,
    "use_ema": false,
    "ema_momentum": 0.99,
    "ema_overwrite_frequency": null,
    "loss_scale_factor": null,
    "gradient_accumulation_steps": null,
    "beta_1": 0.9,
    "beta_2": 0.999,
    "epsilon": 1e-07,
    "amsgrad": false
   },
   "registered_name": null
  },
  "loss": "mean_squared_error",
  "loss_weights": null,
  "metrics": [
   "mean_absolute_error",
   "mean_squared_error",
   {
    "module": "builtins",
    "class_name": "function",
    "config": "mean_error",
    "registered_name": "function"
   },
   {
    "module": "builtins",
    "class_name": "function",
    "config": "r2_score",
    "registered_name": "function"
   }
  ],
  "weighted_metrics": null,
  "run_eagerly": false,
  "steps_per_execution": 1,
  "jit_compile": false
 }
}